<!--法律文档-->
<template>
  <view class="documentsLegal" :class="{'global-page': isIPX }">
    <uni-nav-bar status-bar :title="title"></uni-nav-bar>
    <!--法律内容-->
    <view class="documentsLegal_content">
      <view class="second_col_title_1_content">
        <p>欢迎您使用大爱金孝云科技有限公司为客户提供的系统《大爱金孝》。本协议是由用户（以下可称“用户”或“您”）与本公司就所提供的产品及服务所订立的协议。为保障您的权益，请您在登录使用本公司所提供的产品及服务之前，仔细阅读本协议（18周岁以下未成年人应当在其法定监护人陪同下阅读，并由其监护人代理其为法律行为），包括免除或者限制本公司的免责条款及对用户的权利限制条款。如果您进入本公司或用户登录页面，确认已经阅读、同意本协议的条款并完成登录，或者通过其他任何方式获得和使用本公司所提供的产品和服务，则视为您已经详细阅读了本协议的内容，同意遵守本协议的约定。您不应再以不了解本协议内容为由拒绝履行本协议。此外，本公司有权在不另行通知的情况下，随时对本协议或相关协议进行修改，修改部分即时生效并适用。请您在使用产品和服务时进行关注并遵守，如您不同意修改，您可以随时停止使用；如果您继续使用，则视为您已经接受修改后的协议。</p>
        <p class="col_title">一、定义和说明</p>
        <p>1.1《大爱金孝》：指本公司研发/运营的养老服务系统。</p>
        <p>1.2 本软件：指《大爱金孝》计算机软件，包含客户端内容及程序，并可能包括相关网络服务器、网站、电子媒体、印刷材料和“联机”或电子文档等。</p>
        <p>1.3 用户：指通过本公司提供的合法途径获得《大爱金孝》软件使用许可而安装、使用《大爱金孝》软件产品及服务的个人。</p>
        <p class="col_title">二、知识产权声明</p>
        <p>2.1 本公司依法享有《大爱金孝》的一切合法权属（包括但不限于知识产权）。本软件的全部著作权及一切其他知识产权，以及与本软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩组合、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中国知识产权相关法律法规和有关的国际条约的保护。</p>
        <p>2.2 《大爱金孝》软件所体现的徽标（图形）和/或本公司的产品和服务标示均属于本公司在中国及/或其他国家/地区的商标或者注册商标。用户未经合法授权不得自行使用。</p>
        <p>2.3 本公司在涉及《大爱金孝》软件及相关各项服务中拥有专利权、专利申请权、商标权、著作权及其他知识产权。本公司并未因为本《协议》或者因为向用户提供本《大爱金孝》软件以及相关服务而授予用户任何与本《大爱金孝》软件相关的知识产权。本《协议》未明确授予用户的权利均由本公司保留。</p>
        <p class="col_title">三、隐私政策</p>
        <p>本隐私政策将涵盖本应用如何收集、使用、处理、存储和保护App收集的关于您的个人信息。若我们要求您提供某些信息，以便在使用产品和服务时验证您的身份，我们将仅严格遵守本隐私政策来使用这些信息，请你仔细阅读我们的隐私政策。</p>
        <p>3.1 如何收集您的个人信息</p>
        <p>个人信息是可用于唯一地识别或联系某人的数据。当您使用本应用时，用户登录过程中我们将会收集为您提供服务所必须的个人信息，如：电话号码。为了保护个人隐私，我们只会收集明确及合法的目的所必需的信息，而不会以与这些目的不相符的方式进一步处理相关信息。</p>
        <p>3.2 我们如何使用您的个人信息</p>
        <p>1）通过您提供的个人信息，向您发送本应用的服务信息。</p>
        <p>2）通过您提供的个人信息，为您提供/实现密码找回功能。</p>
        <p>3）除不可抗力外，本公司不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可。</p>
        <p>3.3 保留政策</p>
        <p>如有必要实现收集信息的目的，本应用仅将保留您的个人信息至履行收集目的所需的期限，同时将遵守适用法律规定的数据保留期限。</p>
        <p>3.4 法律免责声明</p>
        <p>在法律要求的情况下，以及本公司认为必须披露与您有关的信息来保护本公司的法定权益和/或遵守司法程序、法院指令或适用本应用程序的法律程序时，我们有权透露您的个人信息。如果本公司确定为了执行本公司的条款和条件或保护我们的经营，披露是合理必须的，则我们可披露与您有关的信息。</p>
        <p>3.5 本隐私政策的更改</p>
        <p>我们会对隐私政策进行定期审核，为反映我们信息惯例的变更，我们可能会更新本隐私政策。如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。我们保留随时修改本政策的权利，因此请经常查看。您若继续使用本应用程序提供的服务，将被视为接受更新的隐私政策。</p>
        <p class="col_title">四、资费政策</p>
        <p>4.1 本公司有权决定系统产品和服务的资费标准和收费方式，本公司可能会就不同的产品和服务制定不同的资费标准和收费方式，也可能按照我们所提供的产品和服务的不同阶段确定不同的资费标准和收费方式。另外，本公司也可能不时地修改相关资费政策。</p>
        <p>4.2 对于本公司系统的收费产品和服务，用户应该按照本公司确定的资费政策购买我们的产品和服务。如果用户未按本公司确定的资费政策购买本公司的产品和服务，本公司可以立即停止向用户提供该产品和服务。</p>
        <p>4.3 除非法律另有明文规定，无论该等资费是否已被消费，本公司有权决定是否、何时、以何种方式向用户退款。本公司同意退款的，用户应补偿支付时使用信用卡、手机等支付渠道产生的费用，该等费用本公司有权在返还用户的资费中直接扣收。本公司在产品和服务提供过程中赠送的充值金额、虚拟货币、虚拟道具等，不予退款或变现。</p>
        <p class="col_title">五、服务、协议的中断或终止</p>
        <p>5.1 如发生下列任何一种情形，本公司有权随时中断或终止向用户提供本协议项下的系统服务和其他网络服务，对于因而产生的不便和损失，本公司不承担任何责任：</p>
        <p>1）用户提供的个人资料不真实；</p>
        <p>2）用户违反本协议中规定的用户行为准则及本协议其他条款约定的义务。</p>
        <p>5.2 关于本公司系统所提供的不同产品和服务注销账号/角色的其他情况，请参见各个系统产品和服务的具体规定，或相关系统产品和服务的官方网站上的具体规定。</p>
        <p>5.3 为了保障系统及系统平台网站和服务器的正常运行，本公司需要定期或不定期对系统及系统平台网站和服务器进行停机维护，或针对突发事件进行紧急停机维护。因上述情况而造成的正常服务中断、中止，用户予以理解并同意，本公司则有义务尽力避免服务中断并将中断时间限制在最短时间内。</p>
        <p>5.4 在适用法律许可的最大范围内，发生下列情形之一时，为了系统网站和服务器的持续稳定运行，本公司有权不经提前通知，终止或中断系统服务器所提供之全部或部分服务，对因此而产生的不便或损失，本公司对用户或第三人均不承担任何责任：</p>
        <p>1）定期检查或施工，更新软硬件等；</p>
        <p>2）服务器遭受损害，无法正常运作；</p>
        <p>3）突发性的软硬件设备与电子通信设备故障；</p>
        <p>4）网络提供商线路或其他故障；</p>
        <p>5）在紧急情况之下依照法律的规定或为用户及第三者之人身安全；</p>
        <p>6）第三方原因或其他不可抗力的情形。</p>
        <p>5.5 在适用法律许可的最大范围内，不管产品和服务由于任何原因终止，用户应采取相应的措施自行处理系统及系统平台上的虚拟物品。用户不得因终止服务而要求本公司承担除用户已经购买但尚未使用的系统虚拟货币以外任何形式的赔偿或补偿责任，包括但不限于因不再能继续使用系统账号、系统内虚拟物品等而要求的赔偿。</p>
        <p class="col_title">六、用户权利与义务</p>
        <p>6.1 在用户同意接受本《协议》全部内容的前提下，本公司同意授予用户可撤销的、可变更的、非专有的、不可转让和不可再授权的许可权利。用户可在许可生效的时间内将本软件安装在个人使用的联网计算机上，并以指定的方式运行本《大爱金孝》软件的一份副本并享受本公司提供的服务。本公司基于本《协议》授予用户的许可是针对个人使用的许可。如用户有需要在个人使用的范围以外使用本软件及服务或者将本软件与服务用于任何商业用途，则用户应与本公司联系并获得本公司另行授权。任何未经本公司许可的安装、使用、访问、显示、运行等行为均视为违反本协议。</p>
        <p>6.2 除非本《协议》另有规定，否则，未经本公司书面同意，用户不得实施下列行为（无论是营利的还是非营利的）：</p>
        <p>1）复制、翻拷、传播和陈列本软件的程序、使用手册和其它图文音像资料的全部或部分内容。</p>
        <p>2）公开展示和播放本产品的全部或部分内容。</p>
        <p>3）出租、销售本软件或者利用本软件从事营利行为。</p>
        <p>4）修改或遮盖本软件程序、图像、动画、包装和手册等内容上的产品名称、公司标志、版权信息等内容。</p>
        <p>5）其它违反著作权法、计算机软件保护条例和相关法律法规的行为。</p>
        <p>6.3 用户应通过合法的途径使用本软件和相关服务，不得作出以下侵害本公司或第三人利益，扰乱系统秩序，违反系统公平性、违反本《协议》或者本公司发布的其他规则或者国家有关法律法规规定的行为，包括但不限于：</p>
        <p>1）修改、翻译、注释、整理、汇编、演绎本软件；</p>
        <p>2）反向工程、反向编译或者反汇编本软件，或者采用其他技术手段对本软件进行分析、修改、攻击、衍生；</p>
        <p>3）使用任何外挂程序或系统修改程序（本《协议》所称“外挂程序”是指独立于系统软件之外的，能够在系统运行的同时影响系统操作的所有程序，包括但不限于模拟键盘鼠标操作、改变操作环境、修改数据等一切类型。如国家有关法律、法规及政府主管部门的规章或规范性文件规定的外挂定义与本《协议》有冲突，则以法律、法规、部门规章或规范性文件规定的为准），对本网络系统软件进行还原工程、编译、译码或修改，包括但不限于修改本软件所使用的任何专有通讯协议、对动态随机存取内存（RAM）中资料进行修改或锁定；</p>
        <p>4）使用异常的方法登录系统、使用网络加速器等外挂软件或机器人程式等恶意破坏服务设施、扰乱正常服务秩序的行为；</p>
        <p>5）通过异常或者非法方式使用本软件（包括但不限于利用本软件登录系统私服），恶意破环本软件，扰乱正常的服务秩序或者实施其他不正当行为；</p>
        <p>6）制作、传播或使用外挂、封包、加速软件及其它各种作弊程序，或组织、教唆他人使用此类软件程序，或销售此类软件程序而为个人或组织谋取经济利益；</p>
        <p>7）使用任何方式或方法，试图攻击提供系统服务的相关服务器、路由器、交换机以及其他设备，以达到非法获得或修改未经授权的数据资料、影响正常系统服务，以及其他危害性目的的任何行为；</p>
        <p>8）利用本软件或者线上系统可能存在的技术缺陷或漏洞而以各种形式为自己及他人牟利（包括但不限于复制系统中的虚拟物品等）或者从事其他不正当行为。</p>
        <p>9）违反国家有关法律法规的规定，利用本软件制作、复制、发布和传播信息。</p>
        <p>一旦本公司通过内部的监测程序发现或经其他用户举报而发现用户有可能正在从事上述行为，则本公司有权作出独立的判断并采取相应的措施，该措施包括但不限于限制用户账号的登陆、限制用户在系统中的活动、终止本软件授权、删除与复制有关的物品（包括复制出的虚拟物品和参与复制的虚拟物品）、删除用户的账号并要求用户赔偿因从事上述行为而给本公司造成的损失等。</p>
        <p>6.4 本公司提供可使用本软件，并运用自己的网络系统通过国际互联网络（Internet）为用户提供服务。同时，用户应自行提供以下的设备和信息：</p>
        <p>1）自行配备上网的所需设备， 包括个人电脑、调制解调器或其他必备上网装置。</p>
        <p>2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用。</p>
        <p>3）基于本公司提供服务的重要性，用户同意：</p>
        <p>（1）提供详尽、准确的个人资料。</p>
        <p>（2）不断更新注册资料，符合及时、详尽、准确的要求。</p>
        <p>（3）牢记用户填写的注册资料、历史信息。</p>
        <p>本公司在为用户提供相关客户服务的前提是用户能表明用户是账号的所有人，这可能需要用户提供相关信息（包括但不限于注册信息、历史密码等）。用户理解，如果用户不能提供准确完整的注册资料及相关历史信息、未及时更新相关注册资料或者相关的证据，将有可能导致本公司无法判断用户的身份，从而无法为提供密码找回等相关服务，而本公司对此不承担任何责任。如因用户提交的相关信息资料不真实、不准确、不完整、不合法从而导致本公司作出错误的判断的，本公司有权终止为用户提供服务并追究用户的法律责任。</p>
        <p>6.5 本公司保留通过本软件和相关的服务向用户投放商业性广告的权利。</p>
        <p class="col_title">七、违约责任</p>
        <p>7.1 用户同意保障和维护本公司及其他用户的利益，如因用户违反有关法律、法规或本《协议》项下的任何条款而给本公司造成损害，用户同意承担由此造成的损害赔偿责任，该等责任包括但不限于给本公司造成的任何直接或间接损失。</p>
        <p>7.2 如用户违反本《协议》、本公司发布的其他规则或者国家法律法规规定，则本公司有权作出独立的判断，立即撤销相关许可，终止为用户提供服务并通过各种合法途径追究用户的法律责任。</p>
        <p class="col_title">八、法律管辖</p>
        <p>8.1 本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
        <p>8.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均应向《大爱金孝》系统平台所在地的人民法院提起诉讼。</p>
        <p class="col_title">九、通知和送达</p>
        <p>本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行； 该通知于发送之日视为已送达收件人。</p>
        <p class="col_title">十、 其他规定</p>
        <p>10.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</p>
        <p>10.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
        <p>附件二</p>
        <p>系统产品隐私政策</p>
        <p>用户须知：</p>
        <p>1.本应用尊重并保护所有使用服务用户的个人隐私权。</p>
        <p>2.为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。</p>
        <p>3.本应用会不时更新本隐私权政策。 请用户时常关注本应用更新的隐私政策。您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。</p>
        <p>4.本隐私权政策属于本应用服务使用协议不可分割的一部分。</p>
        <p class="col_title">一 适用范围</p>
        <p>1.1 在您登录本应用帐号时，您根据本应用要求提供的个人登录信息；</p>
        <p>1.2 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；</p>
        <p>1.3 本应用通过合法途径从商业伙伴处取得的用户个人数据。</p>
        <p>您了解并同意，以下信息不适用本隐私权政策：</p>
        <p>1.4 您在使用本应用平台提供的搜索服务时输入的关键字信息；</p>
        <p>1.5 本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；</p>
        <p>1.6 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。</p>
        <p class="col_title">二 信息使用</p>
        <p>2.1 本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。</p>
        <p>2.2 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。</p>
        <p>2.3 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息。</p>
        <p class="col_title">三 信息披露</p>
        <p>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
        <p>3.1 经您事先同意，向第三方披露；</p>
        <p>3.2 为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
        <p>3.3 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p>3.4 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</p>
        <p>3.5 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
        <p>3.6 在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。</p>
        <p>3.7 另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：</p>
        <p>1） 与国家安全、国防安全直接相关的；</p>
        <p>2） 与公共安全、公共卫生、重大公共利益直接相关的；</p>
        <p>3） 与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
        <p>4） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
        <p>5） 个人信息主体自行向社会公众公开个人信息的；</p>
        <p>6） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p>
        <p class="col_title">四 信息存储和交换</p>
        <p>4.1 本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。</p>
        <p>4.2 我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志。</p>
        <p>一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。</p>
        <p>4.3 产品或服务停止运营时的通知</p>
        <p>当我们的产品或服务发生停止运营的情况时，我们将根据相关法律法规规定进行公告通知，并依法保障您的合法权益。</p>
        <p class="col_title">五 信息安全</p>
        <p>5.1 本应用帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本应用将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。</p>
        <p>5.2 安全事件处置措施</p>
        <p>若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会以公告、推送通知或邮件等形式告知您安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。</p>
      </view>
    </view>
  </view>
</template>

<script>
import uniNavBar from "@/components/uni-nav-bar/uni-nav-bar.vue"
import {mapState, mapMutations} from 'vuex';

export default {
  components: {
    uniNavBar
  },
  data() {
    return {
      title: '隐私条款及用户协议',
        isIPX:this.$isIPX,
    }
  }
}
</script>

<style lang="less" scoped>
@item: {
  display: flex;
  justify-content: center;
  align-items: center;
}

.documentsLegal {
  width: 100%;
  min-height: 100%;
  background: #FFFFFF;

  .head {
    width: 100%;
    height: 5rem;
    display: flex;
	position: fixed;
	top: 0;
	z-index: 10;
  }

  .documentsLegal_content {
    width: 100%;
    // min-height: 30rem;
    @item();
    flex-wrap: wrap;

    .first_col_title {
      width: 94%;
      height: 1.82rem;
      display: flex;
      align-items: center;

      h4 {
        // width: 4.91rem;
        height: 0.91rem;
        font-size: 0.94rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
      }
    }

    .first_col {
      width: 94%;
      height: 7.72rem;
      @item();
      flex-wrap: wrap;
      margin-top: 1.035rem;

      p {
        font-size: 0.815rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
        line-height: 1.375rem;
      }
    }

    .second_col {
      width: 94%;
      height: 4.91rem;
      @item();
      flex-wrap: wrap;
      // margin-top: 0.69rem;
      margin-top: 3.69rem;

      p {
        font-size: 0.815rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
        line-height: 1.375rem;
      }
    }

    .second_col_title {
      width: 94%;
      height: 1.82rem;
      display: flex;
      align-items: center;
      margin-top: 1rem;

      h4 {
        // width: 4.91rem;
        height: 0.91rem;
        font-size: 0.94rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
      }
    }

    .second_col_title_1 {
      width: 94%;
      height: 1.82rem;
      display: flex;
      align-items: center;
      margin-top: 1rem;

      h4 {
        // width: 4.91rem;
        height: 0.91rem;
        font-size: 0.815rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
        line-height: 1.125rem;
      }
    }

    .second_col_title_1_content {
      width: 94%;
      height: 11.97rem;
      //@item();
      flex-wrap: wrap;
      margin: 0.75rem;

      p {
        font-size: 0.95rem;
        font-family: PingFang SC;
        font-weight: 400;
        color: #343434;
        line-height: 1.525rem;
        text-align: left;
      }

      .col_title {
        line-height: 2.525rem;
      }
    }
  }
}
</style>
